Tekla.Structures.ModelInternal.dotClientId_t


Tekla.Structures.ModelInternal.dotClientId_t.ProcessId


Tekla.Structures.ModelInternal.dotClientId_t.ThreadId


Tekla.Structures.ModelInternal.dotClientId_t.GetClientId
Get unique client id for application.
Client id must be used with sequential queries, like
object enumeration.
Returns: Client id